NEW_USER_START_COMMAND = 'Привет!👋 С помощью этого бота ты сможешь подделать QR-код о вакцинации.\n' \
                         'Используй его чтобы сходить в ресторан, но не более! 🍔'
OLD_USER_START_COMMAND = NEW_USER_START_COMMAND
START_COMMAND_BUTTON = 'Начать 👍'
PLEASE_SEND_NAME = 'Отлично! Для имитации страницы вакцинации 💉 мне нужно три вещи: твое ФИО, ' \
                   'твой день рождения, первые 2 и последние 3 цифры твоего паспорта. ' \
                   'Если ты в любой момент поймешь что скинул мне что-то не то, напиши /cancel и начни заново.\n' \
                   'Конечно, никакие из этих данных не будут отданны кому-либо.\n\n' \
                   'Сначала скинь свое ФИО (фамилия имя отчество, как Иванов Иван Иванович). 📛'
PLEASE_SEND_DATE_OF_BIRTH = 'Хорошо, теперь свою дату рождения 🎂. Она должна быть такого формата - 31.12.2020'
PLEASE_SEND_FIRST_2_DIGITS = 'Окей, спасибо! Остался только паспорт 🔢; скинь первые 2 его цифры (2 цифры серии)'
PLEASE_SEND_LAST_3_DIGITS = 'Осталось еще чуть-чуть, только 3 последние цифры паспорта (его номера)'
CONFIRMATION_TEXT = 'Отлично! Теперь проверь, все-ли тут в порядке 👀:\n' \
                    'ФИО: {name}\n' \
                    'Дата рождения: {date_of_birth}\n' \
                    'Первые две и последние три цифры паспорта: {first_two_passport_numbers}, ' \
                    '{last_three_passport_numbers}\n'
YES_CONFIRMATION_BUTTON = 'Да, все верно! ✅'
NO_CONFIRMATION_BUTTON = 'Нет, заново.. ❌'
CANCELLING_TEXT = 'Окей, отмена так отмена ❌ ...\n' \
                  'Напиши /start чтобы начать заново!'
secret_admin_commands = "⚠️команды админа\n" \
                        "/bot_stats - статистика бота\n" \
                        "/site_stats - статистика сайта"
DONE_TEXT = 'Все готово!\n' \
            'Ты можешь сохранить эту картинку себе в галерею 🖼️, и когда тебя попросят ее показать - открыть ее.\n' \
            'Если что, этот код - всего лишь ссылка на сайт госуслуг, так что вот что увидит работник общепита ' \
            'когда ее отсканирует - {url}.'

HELP_MESSAGE = 'помощь - пиши /start чтобы начать, если нашел баг - пиши в /contact чтобы уведомить меня о нем'
CONTACT_MESSAGE = 'контакты - пока что их нет, может потом сделаю бота для того чтобы с ' \
                  'людьми через него общаться (чтоб анонимно)'
