NEW_USER_START_COMMAND = 'Привет!👋 С помощью этого бота ты сможешь сымитировать QR-код о ' \
                         'вакцинации (будет как на картинке, если ты его отсканируешь!).\n' \
                         'Он подойдет чтобы ходить в рестораны, но мы не рекомендуем ' \
                         'использовать его для чего-либо еще. 🍔'
OLD_USER_START_COMMAND = NEW_USER_START_COMMAND
START_COMMAND_BUTTON = 'Начать 👍'
PLEASE_SEND_NAME = 'Отлично! Для имитации страницы вакцинации 💉 мне нужно три вещи: твое ФИО, ' \
                   'твой день рождения, первые 2 и последние 3 цифры твоего паспорта. ' \
                   'Если ты в любой момент поймешь что скинул мне что-то не то, напиши /cancel и начни заново.\n' \
                   '(Конечно, никакие из этих данных не будут отданны кому-либо.)\n\n' \
                   'Сначала скинь свое ФИО (фамилия имя отчество, как Иванов Иван Иванович). 📛'
PLEASE_SEND_DATE_OF_BIRTH = 'Хорошо, теперь свою дату рождения 🎂. Она должна быть такого формата - 31.12.2020'
PLEASE_SEND_FIRST_2_DIGITS = 'Окей, спасибо! Остался только паспорт 🔢; скинь первые 2 его цифры (2 цифры серии)'
PLEASE_SEND_LAST_3_DIGITS = 'Осталось еще чуть-чуть, только 3 последние цифры паспорта (его номера)'
CONFIRMATION_TEXT = 'Отлично! Теперь проверь, все-ли тут в порядке 👀:\n' \
                    'ФИО: {name}\n' \
                    'Дата рождения: {date_of_birth}\n' \
                    'Первые две и последние три цифры паспорта: {first_two_passport_numbers}, ' \
                    '{last_three_passport_numbers}\n'
YES_CONFIRMATION_BUTTON = 'Да, все верно! ✅'
NO_CONFIRMATION_BUTTON = 'Нет, заново.. ❌'
CANCELLING_TEXT = 'Окей, отмена так отмена ❌ ...'
secret_admin_commands = "⚠️команды админа\n" \
                        "/bot_stats - статистика бота\n" \
                        "/site_stats - статистика сайта"
DONE_TEXT = 'Все готово!\n' \
            'Ты можешь сохранить эту картинку себе в галерею 🖼️, и когда тебя попросят ее показать - открыть ее.\n' \
            'Если что, этот код - всего лишь ссылка на сайт госуслуг, так что вот что увидит работник общепита ' \
            'когда ее отсканирует - {url}.'

HELP_MESSAGE = 'Помощь - пиши /start чтобы начать, если нашел баг - пиши в /bugreport чтобы уведомить меня о нем\n' \
               'обо всем остальном пиши в /contact'
CONTACT_MESSAGE = 'контакты - пока что их нет, может потом сделаю бота для того чтобы с ' \
                  'людьми через него общаться (чтоб анонимно).\n' \
                  'Однако, есть /bugreport, может ты хотел написать туда?'
BUG_REPORT_WELCOME = 'Привет, ты нашел баг/ошибку?'
BUG_REPORT_PROCEED = 'Отлично! Опиши ее в своем следующем сообщении и мы передадим это сообщение администрации ' \
                     '(только текст, фотографии/приложения к сообщению не будут переданы).\n' \
                     'Если что, ты все еще можешь написать /cancel чтобы отменить этот репорт.'
THANKS_FOR_BUG_REPORT = 'Передаю это сообщение администрации... 🛵\n' \
                        'Большое спасибо! Ты помогаешь мне становиться лучше.'
BUGREPORT_CANCEL = 'Окей, но если что-нибудь найдешь - обязательно пиши!'
